src/Documents/Scan_ЗаявкаНаОтгрузку/Scan_ЗаявкаНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаНаОтгрузку</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаОтгрузку</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиВыходной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтгрузки</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяЗаявкаНаОтгрузку</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаОтгрузку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Scan_КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтактнойИнформации</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Scan_КлючевыеДатыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КлючевыеДатыПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_ОбъектыКлючевыхДат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ВзаимосвязьИзделийИЗаказов/Scan_ВзаимосвязьИзделийИЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВзаимосвязьИзделийИЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ХарактеристикиИзделия/Scan_ХарактеристикиИзделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ХарактеристикиИзделия</name>
  <comment>Характеристики продукта (scania)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>EnumRef.Scan_ГруппыИзделийOFMS</types>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЦветаКабиныПТС</types>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
      <types>CatalogRef.Scan_ТипыКабинИзделий</types>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      <types>CatalogRef.Scan_ТипыПродуктов</types>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
      <types>CatalogRef.Scan_Сотрудники</types>
      <types>CatalogRef.Scan_ТипыГИБДД</types>
      <types>DocumentRef.Scan_УстановкаПлановыхЦенПродукта</types>
      <types>CatalogRef.Scan_МаркетинговыеТипыПродуктов</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>CatalogRef.Scan_ПаромныеЛинии</types>
      <types>EnumRef.Scan_ТипыСпецификации</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_МаркиПродуктов</types>
      <types>CatalogRef.Scan_ЛокальныеСтатусыПродуктов</types>
      <types>CatalogRef.Scan_СтавкиНДС</types>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
      <types>CatalogRef.Scan_Контрагенты</types>
      <types>CatalogRef.Scan_ТипыКузова</types>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
      <types>CatalogRef.Scan_СпецификацииПродуктов</types>
      <types>String</types>
      <types>CatalogRef.Scan_МоделиПоПТС</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_ТипыТопливаДвигателейПродуктов</types>
      <types>CatalogRef.Scan_Склады</types>
      <types>CatalogRef.Scan_Подразделения</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
      <types>DocumentRef.Scan_ЗаявкаНаОтгрузку</types>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
      <types>CatalogRef.Scan_СтатусыЗаявокНаОтгрузку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоИзделиям</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ВидыДилеров/Scan_ВидыДилеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыДилеров</name>
  <enumValues>
    <name>Независимый</name>
  </enumValues>
  <enumValues>
    <name>Собственный</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_КлючевыеДаты/Scan_КлючевыеДаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_КлючевыеДаты</name>
  <enumValues>
    <name>AAD</name>
    <comment>Actual Audit Date	Фактическая дата проведения аудита ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>ADD</name>
    <comment>Actual Delivery Date	Фактическая дата прихода по первому адресу доставки, указанному в заказе, который отправлен на завод-изготовитель</comment>
  </enumValues>
  <enumValues>
    <name>ADDLBB</name>
    <comment>Actual Delivery Date Local BB	Фактическая дата прихода шасси на площадку кузовостроителя</comment>
  </enumValues>
  <enumValues>
    <name>AN</name>
    <comment>Audit Notification	Дата поступления вызова на аудит от кузовостроителя. </comment>
  </enumValues>
  <enumValues>
    <name>CDD</name>
    <comment>Confirm Delivery Date	Подтвержденная дата прихода по первому адресу доставки. </comment>
  </enumValues>
  <enumValues>
    <name>CDD2</name>
    <comment>Confirm Delivery Date	Подтвержденная дата прихода по первому адресу доставки. Отклонение от даты CDD</comment>
  </enumValues>
  <enumValues>
    <name>CDDX</name>
    <comment>Кол-во дней до даты CDD для отправки напоминания дилерам</comment>
  </enumValues>
  <enumValues>
    <name>CDDПоставщик</name>
    <comment>Confirm Delivery Date of contractor	Подтвержденная поставщиком дата прихода по первому адресу доставки. Дата из файла от поставщика</comment>
  </enumValues>
  <enumValues>
    <name>CRD</name>
    <comment>Confirm Ready Date	Плановая дата выхода продукта с конвейера на заводе. </comment>
  </enumValues>
  <enumValues>
    <name>DCD</name>
    <comment>Desired Customer Date Дата, когда клиент хочет получить готовый автомобиль у дилера</comment>
  </enumValues>
  <enumValues>
    <name>DD</name>
  </enumValues>
  <enumValues>
    <name>DD2</name>
  </enumValues>
  <enumValues>
    <name>DDD</name>
    <comment>Desired Delivery Date Желаемый срок поставки по первому адресу доставки, указанному в заказе на завод изготовитель</comment>
  </enumValues>
  <enumValues>
    <name>DDS</name>
    <comment>DD of SOP</comment>
  </enumValues>
  <enumValues>
    <name>EDD</name>
    <comment>Estimated Delivery Date	Предварительная дата готовности ПК ТС у кузовостроителя </comment>
  </enumValues>
  <enumValues>
    <name>ETA</name>
    <comment>Estimated Time of Arrival	Ожидаемая дата прихода транспортного средства на склад отгрузки</comment>
  </enumValues>
  <enumValues>
    <name>FinishDate</name>
    <comment>Finish Date	Это дата физической готовности продукта на заводе.</comment>
  </enumValues>
  <enumValues>
    <name>PAD</name>
    <comment>Planned Audit Date	Планируемая дата проведения аудита ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>PDD</name>
    <comment>Preliminary Delivery Date	Предварительная дата прихода по первому адресу доставки</comment>
  </enumValues>
  <enumValues>
    <name>PODOD</name>
    <comment>Date of Delivery Дата поставки (дата, указываемая в заказе на закупку на надстройку/оборудование)</comment>
  </enumValues>
  <enumValues>
    <name>PTSD</name>
    <comment>PTS Date	Дата выписки ПТС на ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>RDB</name>
  </enumValues>
  <enumValues>
    <name>RFT</name>
    <comment>Ready for Transfer	Фактическая дата готовности ПК ТС для передачи SRU. </comment>
  </enumValues>
  <enumValues>
    <name>SDDate</name>
    <comment>Specification Definite Date Последний день, когда спецификация заказа может быть изменена. Дата доступна в FAIN\Rain</comment>
  </enumValues>
  <enumValues>
    <name>SoW</name>
    <comment>Start of Warranty	Дата начала гарантии Скания. В SPII это Delivery Date</comment>
  </enumValues>
  <enumValues>
    <name>WED</name>
    <comment>Warranty End Date	Дата окончания гарантии</comment>
  </enumValues>
  <enumValues>
    <name>БроньДилера</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийРезервДилера</name>
  </enumValues>
  <enumValues>
    <name>ДатаБукингЛиста</name>
  </enumValues>
  <enumValues>
    <name>ДатаИнвойса</name>
    <comment>14434</comment>
  </enumValues>
  <enumValues>
    <name>ДатаОтгрузкиСЗаводаПриEXW</name>
  </enumValues>
  <enumValues>
    <name>ДатаПередачиБУИзделияДилеру</name>
  </enumValues>
  <enumValues>
    <name>ДатаПередачиИзделияДилеру</name>
    <comment>Дата фактической передачи продукта дилеру </comment>
  </enumValues>
  <enumValues>
    <name>ДатаПокупкиБУИзделия</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИзделияБУНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИзделияНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИнвойса1С</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиБУДилеру</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиБУКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиИзделия</name>
    <comment>Дата документа продажи продукта дилеру в 1С:УТ</comment>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиКлиенту</name>
    <comment>Дата документа продажи продукта клиенту в SDMS (в SOWA.net – это дата поставки), либо дата документа продажи продукта клиенту в 1С:УТ</comment>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиПродуктаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ДатаСписания</name>
  </enumValues>
  <enumValues>
    <name>Квота</name>
  </enumValues>
  <enumValues>
    <name>ПортСПБ</name>
    <comment>ПортСПБ</comment>
  </enumValues>
  <enumValues>
    <name>ПродуктВАрхиве</name>
    <comment>Техническая дата, означающая проданный продукт, убывший из учета</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ОбъектыКлючевыхДат/Scan_ОбъектыКлючевыхДат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ОбъектыКлючевыхДат</name>
  <enumValues>
    <name>ЗаказНаЗавод</name>
  </enumValues>
  <enumValues>
    <name>Изделие</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЗакупку</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_СтатусыЗаявокНаОтгрузку/Scan_СтатусыЗаявокНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыЗаявокНаОтгрузку</name>
  <predefined>
    <items>
      <name>ЗаявкаНаОтгрузку</name>
      <description>Заявка на отгрузку</description>
    </items>
    <items>
      <name>Исполнена</name>
      <description>Исполнена</description>
    </items>
    <items>
      <name>Одобрена</name>
      <description>Одобрена</description>
    </items>
    <items>
      <name>Отказ</name>
      <description>Отказ</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
    <items>
      <name>Пересмотр</name>
      <description>Пересмотр</description>
    </items>
    <items>
      <name>ПроектЗаявкиНаОтгрузку</name>
      <description>Проект заявки на отгрузку</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>ЧастичноИсполнена</name>
      <description>Частично исполнена</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Scan_ЗаявкаНаОтгрузку/ManagerModule.bsl
Функция ПолучитьСписокЭлементовДляНастройки() Экспорт
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив,, КС);
	
	ТаблицаЭлементов.Колонки.Добавить("ИмяЭлемента",ОписаниеТиповС);
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ФормаКоманднаяПанель");
	МассивЭлементов.Добавить("ГруппаСлужебныеПоля");
	МассивЭлементов.Добавить("Статус");
	МассивЭлементов.Добавить("СтатусОтменить");
	МассивЭлементов.Добавить("СтатусОтправитьДистрибьютору");
	МассивЭлементов.Добавить("СтатусПересмотр");
	МассивЭлементов.Добавить("СтатусНаСогласование");
	МассивЭлементов.Добавить("СтатусОдобрена");
	МассивЭлементов.Добавить("СтатусОтказ");
	МассивЭлементов.Добавить("Дилер");
	МассивЭлементов.Добавить("Контрагент");
	МассивЭлементов.Добавить("ДатаОтгрузки");
	МассивЭлементов.Добавить("НачалоОтгрузки");
	МассивЭлементов.Добавить("ОкончаниеОтгрузки");
	МассивЭлементов.Добавить("Порядок");
	МассивЭлементов.Добавить("СоглашениеОПоставке");
	//rarus agar 21.01.2021 16981 ++
	МассивЭлементов.Добавить("СкладОтгрузки");
	//МассивЭлементов.Добавить("ТребуетсяПерегон");
	//МассивЭлементов.Добавить("МестоДоставки");
	//rarus agar 21.01.2021 16981 --
	МассивЭлементов.Добавить("ТребуетсяХранение");
	МассивЭлементов.Добавить("ГруппаСоглашение");
	МассивЭлементов.Добавить("КонтактныеЛица");
	МассивЭлементов.Добавить("Продукты");
	МассивЭлементов.Добавить("ПерейтиВМонитор");
	МассивЭлементов.Добавить("ДобавитьСообщение");
	МассивЭлементов.Добавить("СообщенияПользователей");
	МассивЭлементов.Добавить("ПродуктыПеренестиНепроданные");
	МассивЭлементов.Добавить("ПродуктыУдалитьНепроданные");
	МассивЭлементов.Добавить("ПродуктыОчистить");
	МассивЭлементов.Добавить("Комментарий");
	//rarus vikhle 22.01.2021 mt 16981 +++
	МассивЭлементов.Добавить("ПродуктыСкладПродажи");
	МассивЭлементов.Добавить("ПродуктыМестоПередачи");
	//rarus vikhle 22.01.2021 mt 16981 ---
	
	Для Каждого ИмяЭлемента Из МассивЭлементов Цикл
		СтрокаЭлемента = ТаблицаЭлементов.Добавить();
		СтрокаЭлемента.ИмяЭлемента = ИмяЭлемента;
	КонецЦикла;
	
	Возврат ТаблицаЭлементов;
	
КонецФункции

Процедура УстановитьИсполнениеПоПродукту(Продукт, ДатаПродажи, ВидКлючевойДаты) Экспорт //rarus vikhle 22.03.2021 mt 17324 добавил ВидКлючевойДаты
	
	ЗаявкаНаОтгрузку             = Неопределено;
	КоличествоПроданныхПродуктов = 0;
	ТипДилера					 = Неопределено; //rarus vikhle 10.03.2021 mt 17324
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукт", Продукт);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка КАК ЗаявкаНаОтгрузку,
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Продукт КАК Продукт
	|ИЗ
	|	Документ.Scan_ЗаявкаНаОтгрузку.Продукты КАК Scan_ЗаявкаНаОтгрузкуПродукты
	|ГДЕ
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка
	|			ИЗ
	|				Документ.Scan_ЗаявкаНаОтгрузку.Продукты КАК Scan_ЗаявкаНаОтгрузкуПродукты
	|			ГДЕ
	|				Scan_ЗаявкаНаОтгрузкуПродукты.Продукт = &Продукт
	|				И НЕ Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка.ПометкаУдаления
	|				И (Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка.Статус = ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаОтгрузку.Одобрена)
	|					ИЛИ Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка.Статус = ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаОтгрузку.ЧастичноИсполнена))
	|			УПОРЯДОЧИТЬ ПО
	|				Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка.Дата УБЫВ)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаявкаНаОтгрузку = Выборка.ЗаявкаНаОтгрузку;
		ТипДилера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаНаОтгрузку,"Дилер.ВидДилера");//rarus vikhle 10.03.2021 mt 17324	
		//rarus vikhle 22.03.2021 mt 17324 +++
		Если ТипДилера = Перечисления.Scan_ВидыДилеров.Собственный 
			И (ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиИзделия ИЛИ ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУДилеру) Тогда
			Возврат;
		ИначеЕсли (ТипДилера = Перечисления.Scan_ВидыДилеров.Независимый ИЛИ ТипДилера.Пустая())
			И (ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиКлиенту ИЛИ ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУКлиенту) Тогда
			Возврат;	
		//rarus vikhle 23.03.2021 mt 17497 +++	
		ИначеЕсли ТипДилера = Перечисления.Scan_ВидыДилеров.Собственный 
			И ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиКлиенту 
			И Продукт.БУ Тогда
			Возврат;
		ИначеЕсли ТипДилера = Перечисления.Scan_ВидыДилеров.Собственный 
			И ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУКлиенту 
			И НЕ Продукт.БУ Тогда 	
			Возврат;
		ИначеЕсли (ТипДилера = Перечисления.Scan_ВидыДилеров.Независимый ИЛИ ТипДилера.Пустая())  
			И ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиИзделия 
			И Продукт.БУ Тогда 	
			Возврат;
		ИначеЕсли (ТипДилера = Перечисления.Scan_ВидыДилеров.Независимый ИЛИ ТипДилера.Пустая())  
			И ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУДилеру 
			И НЕ Продукт.БУ Тогда 	
			Возврат;	
		//rarus vikhle 23.03.2021 mt 17497 ---	
		КонецЕсли;	
		//rarus vikhle 22.03.2021 mt 17324 ---
	КонецЕсли;
			
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Продукт = Продукт Тогда
			ДатаПродажиПродукта = ДатаПродажи;
		Иначе
			Если Выборка.Продукт.БУ 
				И НЕ ТипДилера = Перечисления.Scan_ВидыДилеров.Собственный Тогда //rarus vikhle 10.03.2021 mt 17324 
				ДатаПродажиПродукта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(Выборка.Продукт,
				Перечисления.Scan_ОбъектыКлючевыхДат.Изделие, Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУДилеру, ТекущаяДата());
			//rarus vikhle 10.03.2021 mt 17324 +++	
			ИначеЕсли Выборка.Продукт.БУ И ТипДилера = Перечисления.Scan_ВидыДилеров.Собственный Тогда
				//Для собственных дилеров для БУ ориентируемся на ДатуПродажиБУКлиенту
				ДатаПродажиПродукта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(Выборка.Продукт,
				Перечисления.Scan_ОбъектыКлючевыхДат.Изделие, Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУКлиенту, ТекущаяДата()); 	
			ИначеЕсли НЕ Выборка.Продукт.БУ И ТипДилера = Перечисления.Scan_ВидыДилеров.Собственный Тогда
				//Для собственных дилеров для новых ориентируемся на ДатуПродажиКлиенту
				ЗаказНаЗавод = РегистрыСведений.Scan_ВзаимосвязьИзделийИЗаказов.ПолучитьЗаказПоИзделию(Выборка.Продукт);
				
				ДатаПродажиПродукта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(ЗаказНаЗавод,
				Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, Перечисления.Scan_КлючевыеДаты.ДатаПродажиКлиенту, ТекущаяДата()); 	 
			//rarus vikhle 10.03.2021 mt 17324 ---	
			Иначе
				ЗаказНаЗавод = РегистрыСведений.Scan_ВзаимосвязьИзделийИЗаказов.ПолучитьЗаказПоИзделию(Выборка.Продукт);
				
				ДатаПродажиПродукта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(ЗаказНаЗавод,
				Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, Перечисления.Scan_КлючевыеДаты.ДатаПродажиИзделия, ТекущаяДата());
			КонецЕсли;
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(ДатаПродажиПродукта) 
			И ТипЗнч(ДатаПродажиПродукта) = Тип("Дата")
			И ДатаПродажиПродукта <> Дата(1,1,1) 
			Тогда
			КоличествоПроданныхПродуктов = КоличествоПроданныхПродуктов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоПроданныхПродуктов > 0 Тогда
		ЗаявкаНаОтгрузкуОбъект = ЗаявкаНаОтгрузку.ПолучитьОбъект();
		
		Если ЗаявкаНаОтгрузкуОбъект.Продукты.Количество() = КоличествоПроданныхПродуктов Тогда
			ЗаявкаНаОтгрузкуОбъект.Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыЗаявокНаОтгрузку.Исполнена");
		Иначе
			ЗаявкаНаОтгрузкуОбъект.Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыЗаявокНаОтгрузку.ЧастичноИсполнена");
		КонецЕсли;
		
		Попытка
			ЗаявкаНаОтгрузкуОбъект.Записать();
		Исключение КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНепроданныеПродукты(ЗаявкаНаОтгрузку) Экспорт
	
	ВидДилера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаНаОтгрузку, "Дилер.ВидДилера");//rarus vikhle 11.08.2021 mt 18134
	НепроданныеПродукты = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаявкаНаОтгрузку", ЗаявкаНаОтгрузку);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Продукт КАК Продукт,
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Продукт.Аренда КАК Аренда,
	//Rarus bonmak 16.05.2022 19158 ++
	//|	Scan_ЗаявкаНаОтгрузкуПродукты.Продукт.ДемоИТест КАК ДемоИТест,
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Продукт.Демо КАК Демо,
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Продукт.Тест КАК Тест,
	//Rarus bonmak 16.05.2022 19158 --
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Продукт.БУ КАК БУ
	|ИЗ
	|	Документ.Scan_ЗаявкаНаОтгрузку.Продукты КАК Scan_ЗаявкаНаОтгрузкуПродукты
	|ГДЕ
	|	Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка = &ЗаявкаНаОтгрузку";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Продукт.БУ Тогда
			//rarus vikhle 11.08.2021 mt 18134 +++
			Если ВидДилера = Перечисления.Scan_ВидыДилеров.Собственный Тогда
				ДатаПродажиПродукта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(Выборка.Продукт,
				Перечисления.Scan_ОбъектыКлючевыхДат.Изделие, Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУКлиенту, ТекущаяДатаСеанса());	
			Иначе //rarus vikhle 11.08.2021 mt 18134 ---
				ДатаПродажиПродукта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(Выборка.Продукт,
				Перечисления.Scan_ОбъектыКлючевыхДат.Изделие, Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУДилеру, ТекущаяДатаСеанса());	
			КонецЕсли;	
		Иначе
			ЗаказНаЗавод = РегистрыСведений.Scan_ВзаимосвязьИзделийИЗаказов.ПолучитьЗаказПоИзделию(Выборка.Продукт);
			//rarus vikhle 11.08.2021 mt 18134 +++
			Если ВидДилера = Перечисления.Scan_ВидыДилеров.Собственный Тогда
				ДатаПродажиПродукта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(ЗаказНаЗавод,
				Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, Перечисления.Scan_КлючевыеДаты.ДатаПродажиКлиенту, ТекущаяДатаСеанса());	
			Иначе //rarus vikhle 11.08.2021 mt 18134 ---	
				ДатаПродажиПродукта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(ЗаказНаЗавод,
				Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, Перечисления.Scan_КлючевыеДаты.ДатаПродажиИзделия, ТекущаяДатаСеанса());	
			КонецЕсли;	
		КонецЕсли;
		
		Если  ТипЗнч(ДатаПродажиПродукта) = Тип("Дата")
			И ДатаПродажиПродукта = Дата(1,1,1) 
			Тогда
			НепроданныеПродукты.Добавить(Выборка.Продукт);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НепроданныеПродукты;
	
КонецФункции

// rarus vikhle 27.05.2021 mt 17653 +++
//  	
// Параметры:
//  ЗаявкаНаОтгрузкуСсылка	 - 	 - 
//  МассивПродуктов			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСкладыДоИзменений(ЗаявкаНаОтгрузкуСсылка,МассивПродуктов) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_Изделия.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ПродуктыЗаявки
	               |ИЗ
	               |	Справочник.Scan_Изделия КАК Scan_Изделия
	               |ГДЕ
	               |	Scan_Изделия.Ссылка В(&ПродуктыЗаявкиНаОтгрузку)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(Scan_ХарактеристикиИзделия.Период) КАК ПериодСкладПродажи,
	               |	МАКСИМУМ(Scan_ХарактеристикиИзделия1.Период) КАК ПериодМестоПередачи,
	               |	ПродуктыЗаявки.Ссылка КАК Продукт
	               |ПОМЕСТИТЬ ВТ_Периодов
	               |ИЗ
	               |	ПродуктыЗаявки КАК ПродуктыЗаявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ХарактеристикиИзделия КАК Scan_ХарактеристикиИзделия
	               |		ПО ПродуктыЗаявки.Ссылка = Scan_ХарактеристикиИзделия.Изделие
	               |			И (НЕ Scan_ХарактеристикиИзделия.Источник = &ЗаявкаНаОтгрузку)
	               |			И (Scan_ХарактеристикиИзделия.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.Scan_ДополнительнаяИнформацияПоИзделиям.СкладПродажи))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ХарактеристикиИзделия КАК Scan_ХарактеристикиИзделия1
	               |		ПО ПродуктыЗаявки.Ссылка = Scan_ХарактеристикиИзделия1.Изделие
	               |			И (НЕ Scan_ХарактеристикиИзделия1.Источник = &ЗаявкаНаОтгрузку)
	               |			И (Scan_ХарактеристикиИзделия1.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.Scan_ДополнительнаяИнформацияПоИзделиям.МестоПередачи))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродуктыЗаявки.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Scan_ХарактеристикиИзделия.Значение КАК СкладПродажи,
	               |	Scan_ХарактеристикиИзделия1.Значение КАК МестоПередачи,
	               |	ВТ_Периодов.Продукт КАК Продукт
	               |ИЗ
	               |	ВТ_Периодов КАК ВТ_Периодов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ХарактеристикиИзделия КАК Scan_ХарактеристикиИзделия
	               |		ПО ВТ_Периодов.ПериодСкладПродажи = Scan_ХарактеристикиИзделия.Период
	               |			И (Scan_ХарактеристикиИзделия.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.Scan_ДополнительнаяИнформацияПоИзделиям.СкладПродажи))
	               |			И ВТ_Периодов.Продукт = Scan_ХарактеристикиИзделия.Изделие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ХарактеристикиИзделия КАК Scan_ХарактеристикиИзделия1
	               |		ПО ВТ_Периодов.ПериодМестоПередачи = Scan_ХарактеристикиИзделия1.Период
	               |			И (Scan_ХарактеристикиИзделия1.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.Scan_ДополнительнаяИнформацияПоИзделиям.МестоПередачи))
	               |			И ВТ_Периодов.Продукт = Scan_ХарактеристикиИзделия1.Изделие"; 
	Запрос.УстановитьПараметр("ЗаявкаНаОтгрузку", ЗаявкаНаОтгрузкуСсылка);
	Запрос.УстановитьПараметр("ПродуктыЗаявкиНаОтгрузку", МассивПродуктов);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
	
КонецФункции
//rarus vikhle 27.05.2021 mt 17653 ---

// Обновляет реквизит "СоглашениеОПоставке" (Заявка) в заявках на отгрузку, в которые входят переданные продукты
Процедура ОбновитьЗаявкуВЗаявкахНаОтгрузкуПродуктов(МассивПродуктов, Заявка) Экспорт //rarus vikhle 01.09.2021 mt 18228 +++ 
	
	МассивЗаявокНаОтгрузку = ПолучитьЗаявкиНаОгрузкуПродукта(МассивПродуктов);
	Для Каждого ЗаявкаНаОтгрузку Из МассивЗаявокНаОтгрузку Цикл
		Если НЕ ЗаявкаНаОтгрузку.СоглашениеОПоставке = Заявка Тогда  
			ОбъектЗаявкаНаОтгрузку = ЗаявкаНаОтгрузку.ПолучитьОбъект();
			//ОбъектЗаявкаНаОтгрузку.Заблокировать(); //rarus vikhle 03.09.2021 АПК //rarus vikhle 01.10.2021 m 18362
			ОбъектЗаявкаНаОтгрузку.СоглашениеОПоставке = Заявка;
			Попытка
				 ОбъектЗаявкаНаОтгрузку.Записать();
				 ВывестиСообщениеПол(Нстр("ru = 'В заявке на отгрузку %1 обновлен реквизит ""Заявка"".'"),,,,,ОбъектЗаявкаНаОтгрузку.Ссылка);
			Исключение 
			   	ЗаписьЖурналаРегистрации(Нстр("ru = 'Запись заявки на отгрузку'", ОбщегоНазначения.КодОсновногоЯзыка()), //rarus vikhle 03.09.2021 АПК +2й параметр Нстр
										УровеньЖурналаРегистрации.Ошибка,,
										ОбъектЗаявкаНаОтгрузку.Ссылка,
										Нстр("ru = 'Произошла ошибка при записи заявки на отгрузку. '") + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;							
	КонецЦикла;	
	
КонецПроцедуры //rarus vikhle 01.09.2021 mt 18228 ---

// Возвращает массив заявок на отгрузку, в которые входят переданные продукты
Функция ПолучитьЗаявкиНаОгрузкуПродукта(Продукт, Дилер = Неопределено) Экспорт //rarus vikhle 01.09.2021 mt 18228 +++
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка КАК ЗаявкаНаОтгрузку
	               |ИЗ
	               |	Документ.Scan_ЗаявкаНаОтгрузку.Продукты КАК Scan_ЗаявкаНаОтгрузкуПродукты
	               |ГДЕ
	               |	НЕ Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка.Статус В (&СтатусыОтмены)
	               |	И НЕ Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка.ПометкаУдаления
	               |	И Scan_ЗаявкаНаОтгрузкуПродукты.Продукт В (&ТекущийПродукт)";
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыЗаявокНаОтгрузку.Отказ);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыЗаявокНаОтгрузку.Отменена);	
	Запрос.УстановитьПараметр("СтатусыОтмены", МассивСтатусов);
	Запрос.УстановитьПараметр("ТекущийПродукт",Продукт);
	
	Если НЕ Дилер = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И НЕ Scan_ЗаявкаНаОтгрузкуПродукты.Ссылка.Дилер = &Дилер";
		Запрос.УстановитьПараметр("Дилер",Дилер);
	КонецЕсли;	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивЗаявок = РезультатЗапроса.ВыгрузитьКолонку("ЗаявкаНаОтгрузку");
	
	Возврат МассивЗаявок;	
	
КонецФункции //rarus vikhle 01.09.2021 mt 18228 ---
